dc = {'새우깡':700, '콘치즈': 850, '꼬깔콘': 750}
dc['홈런볼'] = 900
dc                   # {'새우깡': 700, '콘치즈': 850, '꼬깔콘': 750, '홈런볼': 900}
for i in dc:
    dc[i] += 100
dc                   # {'새우깡': 800, '콘치즈': 950, '꼬깔콘': 850, '홈런볼': 1000}
del dc['콘치즈']
dc                   # {'새우깡': 800, '꼬깔콘': 850, '홈런볼': 1000}
dc['치즈콘'] = 950  
dc                   # {'새우깡': 800, '꼬깔콘': 850, '홈런볼': 1000, '치즈콘': 950} 

#1-1)
dc = {'새우깡':700, '콘치즈': 850, '꼬깔콘': 750}
if '홈런볼' not in dc:
    dc['홈런볼'] = 900
    
# 1-3)
if '콘치즈' in dc:
    del dc['콘치즈']
if '치즈콘' not in dc:
    dc['치즈콘'] = 950